// pages/my/agreement/agreement.js
Page({

	/**
	 * 页面的初始数据
	 */
	data: {
		title:"尊敬的客户, 欢迎您注册成为子弹找房用户。在注册前请您仔细阅读如下服务条款:",
		agreement: [{
				title: ' ',
				content: '本服务协议双方为本网站与本网站客户,本服务协议具有合同效力。您确认本服务协议后,本服务协议即在您和本网站之间产生法律效力。 请您务必在注册之前认真阅读全部服务协议内容，如有任何疑问,可向本网站咨询。无论您事实.上是否在注册之前认真阅读了本服务协议,只要您点击协议正本下方的 "注册”按钮并按照本网站注册程序成功注册为用户,您的行为仍然表示您同意并签署了本服务协议。 '
			},
			{
				title: '1、本网站服务条款的确认和接纳',
				content: '本网站各项服务的所有权和运作权归本网站拥有。 '
			},
			{
				title: '2、用户必须:',
				content: '(1)自行配备上网的所需设备, 包括个人电脑、调制解调器或其他必备.上网装置。(2) 自行负担个人， 上网所支付的与此服务有关的电话费用、 网络费用。 '
			},
			{
				title: '2、用户必须:',
				content: '(1)自行配备上网的所需设备, 包括个人电脑、调制解调器或其他必备.上网装置。(2) 自行负担个人， 上网所支付的与此服务有关的电话费用、 网络费用。 '
			},
			{
				title: '2、用户必须:',
				content: '(1)自行配备上网的所需设备, 包括个人电脑、调制解调器或其他必备.上网装置。(2) 自行负担个人， 上网所支付的与此服务有关的电话费用、 网络费用。 '
			},
			{
				title: '2、用户必须:',
				content: '(1)自行配备上网的所需设备, 包括个人电脑、调制解调器或其他必备.上网装置。(2) 自行负担个人， 上网所支付的与此服务有关的电话费用、 网络费用。 '
			},
			{
				title: '2、用户必须:',
				content: '(1)自行配备上网的所需设备, 包括个人电脑、调制解调器或其他必备.上网装置。(2) 自行负担个人， 上网所支付的与此服务有关的电话费用、 网络费用。 '
			},
			{
				title: '2、用户必须:',
				content: '(1)自行配备上网的所需设备, 包括个人电脑、调制解调器或其他必备.上网装置。(2) 自行负担个人， 上网所支付的与此服务有关的电话费用、 网络费用。 '
			},
			
			
		]
	},

	/**
	 * 生命周期函数--监听页面加载
	 */
	onLoad: function(options) {

	},

	/**
	 * 生命周期函数--监听页面初次渲染完成
	 */
	onReady: function() {

	},

	/**
	 * 生命周期函数--监听页面显示
	 */
	onShow: function() {

	},

	/**
	 * 生命周期函数--监听页面隐藏
	 */
	onHide: function() {

	},

	/**
	 * 生命周期函数--监听页面卸载
	 */
	onUnload: function() {

	},

	/**
	 * 页面相关事件处理函数--监听用户下拉动作
	 */
	onPullDownRefresh: function() {

	},

	/**
	 * 页面上拉触底事件的处理函数
	 */
	onReachBottom: function() {

	},

	/**
	 * 用户点击右上角分享
	 */
	onShareAppMessage: function() {

	}
})
